letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
        if (!battery->is_init()) {
            if ((getCurrentMillis() - timeout) >= 5000) {
                ssd->fill(0x00);
                ssd->drawText("TIMEOUT", 44, 50, 0xFF);
                ssd->drawText("No battery connected", 4, 60, 0xFF);
                ssd->show();
            }
        }
        else {
            if (is_first_page) {
                ssd->fill(0x00);
                ssd->drawText("Charge: " + fToStr(battery->state_of_charge(), 0) + "%", 5, 45, 0xFF);
                ssd->drawText("Voltage: " + fToStr(battery->get_voltage(), 2) + "V", 5, 53, 0xFF);
                ssd->drawText("Avg. Current: " + fToStr(battery->get_average_current(), 2) + "A", 5, 62, 0xFF);
                ssd->drawText("Avg. Power: " + fToStr(battery->get_average_power(), 2) + "W", 5, 71, 0xFF);
                ssd->show();
            }
            else {
                ssd->fill(0x00);
                ssd->drawText("Temp.: " + fToStr(battery->get_temperature(), 2) + "C", 5, 45, 0xFF);

                sprintf(buff, "0x%04X", battery->device_type());
                ssd->drawText("Dev. type: " + std::string(buff), 5, 53, 0xFF);

                sprintf(buff, "0x%04X", battery->firmware_version());
                ssd->drawText("Firm. ver: " + std::string(buff), 5, 62, 0xFF);

                sprintf(buff, "0x%04X", battery->dm_code());
                ssd->drawText("DM code: " + std::string(buff), 5, 71, 0xFF);

                ssd->show();
            }

            if (getCurrentMillis() - timeout > 3000) {
                is_first_page = !is_first_page;
                timeout       = getCurrentMillis();
            }
        }

        fiber_sleep(10);
    }
}

void show_pads()
{
    int r = 3;

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        bool gp1 = mcp->getLevel(MCP_GPIO_1) == MCP_LOGIC_LEVEL::HIGH;
        bool gp2 = mcp->getLevel(MCP_GPIO_2) == MCP_LOGIC_LEVEL::HIGH;
        bool gp3 = mcp->getLevel(MCP_GPIO_3) == MCP_LOGIC_LEVEL::HIGH;
        bool gp4 = mcp->getLevel(MCP_GPIO_4) == MCP_LOGIC_LEVEL::HIGH;

        ssd->fill(0x00);
        ssd->drawCircle(8, 41, r, true, 0xFF);
        ssd->drawCircle(14, 30, r, gp3, 0xFF);
        ssd->drawCircle(22, 20, r, gp4, 0xFF);
        ssd->drawCircle(32, 13, r, false, 0xFF);
        ssd->drawChar('G', 30, 10, 0xFF);
        ssd->drawChar('V', 6, 38, 0x00);

        ssd->drawCircle(119, 41, r, true, 0xFF);
        ssd->drawCircle(113, 30, r, gp2, 0xFF);
        ssd->drawCircle(105, 20, r, gp1, 0xFF);
        ssd->drawCircle(95, 13, r, false, 0xFF);
        ssd->drawChar('G', 93, 10, 0xFF);
        ssd->drawChar('V', 117, 38, 0x00);

        ssd->drawChar(gp3 ? '1' : '0', 12, 27, gp3 ? 0x00 : 0xFF);
        ssd->drawChar(gp4 ? '1' : '0', 20, 17, gp4 ? 0x00 : 0xFF);
        ssd->drawChar(gp2 ? '1' : '0', 111, 27, gp2 ? 0x00 : 0xFF);
        ssd->drawChar(gp1 ? '1' : '0', 103, 17, gp1 ? 0x00 : 0xFF);

        ssd->show();

        fiber_sleep(10);
    }
}

void show_jacdac()
{
    uint32_t timeout     = 0;
    uint8_t data_to_send = 0;
    char buff[3]         = {0};
    bool is_tx_mode      = true;
    jacdac->setMode(SingleWireMode::SingleWireTx);

    timeout = getCurrentMillis();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (click_button(btnA)) {
            if (is_tx_mode) {
                is_tx_mode = false;
                jacdac->setMode(SingleWireMode::SingleWireRx);
                memset(buff, 'x', 3);
            }
            else {
                is_tx_mode = true;
                jacdac->setMode(SingleWireMode::SingleWireTx);
                data_to_send = 0;
            }

            timeout = getCurrentMillis();
        }

        if (is_tx_mode) {
            if (getCurrentMillis() - timeout > 1000) {
                data_to_send++;
                timeout = getCurrentMillis();
            }

            sprintf(buff, "%03u", data_to_send);

            ssd->fill(0x00);
            ssd->drawText("Mode: Tx", 40, 24, 0xFF);
            ssd->drawText("Send value:", 34, 51, 0xFF);
            ssd->drawText(buff, 56, 62, 0xFF);
            ssd->drawText("A: Change to Rx", 19, 95, 0xFF);
            ssd->show();

            jacdac->putc(data_to_send);
        }
        else {
            uint8_t rcv = jacdac->getc();

            if (rcv != DEVICE_NO_DATA) {
                sprintf(buff, "%03u", rcv);
            }

            ssd->fill(0x00);
            ssd->drawText("Mode: Rx", 40, 24, 0xFF);
            ssd->drawText("Read value:", 34, 51, 0xFF);
            ssd->drawText(buff, 56, 62, 0xFF);
            ssd->drawText("A: Change to Tx", 19, 95, 0xFF);
            ssd->show();
        }

        fiber_sleep(100);
    }
}
void show_qwic()
{
    ssd->fill(0x00);
    ssd->drawText("  Not available...", 5, 60, 0xFF);
    ssd->show();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        fiber_sleep(1);
    }
}

void Demo_main(codal::STM32STEAM32_WB55RG& steam32)
{
    spi     = &steam32.spi1;
    cs      = &steam32.io.PD_0;
    dc      = &steam32.io.PB_4;
    rst     = &steam32.io.PA_12;
    ssd     = new SSD1327_SPI(*spi, *cs, *dc, *rst, 128, 128);
    btnMenu = &steam32.io.PA_0;
    btnA    = &steam32.io.PA_7;
    btnB    = &steam32.io.PA_8;
    buzzer  = &steam32.io.PA_11;

    led_red   = &steam32.io.PC_12;
    led_green = &steam32.io.PC_11;
    led_blue  = &steam32.io.PC_10;

    buzzer->setAnalogValue(0);

    steam32.serial.init(115200);
    steam32.sleep(500);

    printf("Init peripherals !\r\n");

    ssd->init();
    ssd->fill(0x00);
    ssd->drawText("Initialization...", 15, 60, 0xFF);
    ssd->show();

    battery = new BQ27441(&steam32.i2c1);
    mcp     = new MCP23009E(steam32.i2c1, 0x40, steam32.io.PB_1, steam32.io.PB_0);
    hts     = new HTS221(&steam32.i2c1, 0xBE);
    pres    = new WSEN_PADS(steam32.i2c1, 0xBA);
    apds    = new APDS9960(steam32.i2c1, 0x72);
    tof     = new VL53L1X(&steam32.i2c1);
    ism     = new ISM330DL(&steam32.i2c1);
    lis     = new LIS2MDL(&steam32.i2c1);
    sai     = new STM32SAI(&steam32.io.PA_10, &steam32.io.PA_3, GPIO_AF3_SAI1, AUDIO_BUFFER);
    jacdac  = new STM32SingleWireSerial(steam32.io.PB_6);
    rtc     = new STM32RTC();

    battery->init();

