letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
    mcp->setup(MCP_GPIO_1, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_2, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_3, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_4, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GP_RIGHT, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_BOTTOM, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_LEFT, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_UP, MCP_DIR::INPUT);

    hts->init();
    hts->setOutputRate(codal::HTS221_OUTPUT_RATE::RATE_7HZ);

    pres->init();

    tof->init();

    ism->init();
    ism->setAccelerometerODR(ISM_ODR::F_1_66_KHZ);
    ism->setGyroscopeODR(ISM_ODR::F_208_HZ);

    lis->init();
    lis->setODR(LIS2_ODR::F_50_HZ);
    lis->setLowPassFilter(true);

    apds->init();

    if (!sai->init()) {
        printf("Failed to init SAI\r\n");
    }
    sai->onReceiveData(micro_on_data);

    jacdac->init(115200);
    jacdac->setMode(SingleWireMode::SingleWireTx);

    rtc->init();

    steam32.sleep(500);

    ssd->fill(0x00);
    ssd->drawText("Hello STeamy !", 20, 60, 0xFF);
    ssd->show();
    printf("Hello STeamy !\r\n");
    steam32.sleep(1500);

    vector<MenuEntry> mainMenuEntries = {{"Temp & Hum", []() -> void { show_temp_hum(); }},
                                         {"Pressure", []() -> void { show_pressure(); }},
                                         {"Time Of Flight", []() -> void { show_tof(); }},
                                         {"Acc / Gyro / Magn", []() -> void { show_acc_gyro_magn(); }},
                                         {"Color Sensor", []() -> void { show_optical_sensor(); }},
                                         {"Microphone", []() -> void { show_microphone(); }},
                                         {"RTC", []() -> void { show_rtc(); }},
                                         {"Buzzer", []() -> void { show_buzzer(); }},
                                         {"Buttons", []() -> void { show_button(); }},
                                         {"LEDs", []() -> void { show_rgb(); }},
                                         {"Screen", []() -> void { show_screen(); }},
                                         {"Battery", []() -> void { show_battery(); }},
                                         {"Pads \"tete\"", []() -> void { show_pads(); }},
                                         {"(QWIC)", []() -> void { show_qwic(); }},
                                         {"(jacdac)", []() -> void { show_jacdac(); }}};
    mainMenu                          = new ScreenMenu(*ssd, mainMenuEntries);

    while (1) {
        show_main_menu();
    }
}